porous/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  | =========                 |                                                 |
  | \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
  |  \\    /   O peration     | Version:  v3.0+                                 |
  |   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
  |    \\/     M anipulation  |                                                 |
  \*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
  p
  {
    solver          PCG;
    preconditioner  DIC;
    tolerance       1e-06;
    relTol          0;
  }

  U
  {
    solver          smoothSolver;
    smoother        symGaussSeidel;
    tolerance       1e-05;
    relTol          0;
  }
}

PISO
{
  nCorrectors     2;
  nNonOrthogonalCorrectors 0;
  pRefCell        0;
  pRefValue       0;
}

SIMPLE
{

  nNonOrthogonalCorrectors 0;
  pRefCell        0;
  pRefValue       0;

  residualControl
  {
    p               1e-5;
    U               1e-5;
  }
}

relaxationFactors
{
  fields
  {
    p               0.3;
  }
  equations
  {
    U               0.7;
  }
}


// ************************************************************************* //
